[
  {
    "company": "SRM Institute of Science and Technology",
    "role": "Bachelor's in Computer Science and Engineering",
    "education": true,
    "duration": "July 2018 - June 2022",
    "courses": "Object Oriented Programming, Data Structures and Algorithms, Database Management Systems, Operating Systems, and Advanced Calculus and Complex Analysis."
  }, 
   {
    "company": "The Sparks Foundation",
    "role": "Web Developer Intern",
    "duration": "January 2021 - February 2021",
    "techs": ["JavaScript", "HTML5", "CSS", "Payment Gateway APIs"],
    "work": [
      "Studied user requirements to understand project goals and deadlines.",
      "Took notes during team meetings and relayed important information to the dev team.",
      "Collaborated closely with developers to implement new features.",
      "Pitched feature improvements and enhancements for applications.",
      "Built a donation website that integrated payment gateways and automated invoicing upon successful payment."
    ]
  },
    {
    "company": "Across The Globe (ATG)",
    "role": "Software Developer Intern",
    "duration": "March 2021 - September 2021",
    "techs": ["React", "JavaScript", "PHP", "Semantic UI", "Git", "Agile"],
    "work": [
      "Learned software engineering process improvements and best practices.",
      "Supported development, QA, and UX staff to develop new products.",
      "Documented technical workflows and created onboarding knowledge for new hires.",
      "Developed a GitHub progress-tracking extension to help testers and tech leads monitor developer activity, reducing manual tracking.",
      "Resolved daily bugs on the master website and built a Crop & Field Management UI using React JS and Semantic UI."
    ]
  },
  {
    "company": "Banao Technologies",
    "role": "Full Stack Engineer (Intern)",
    "duration": "June 2021 - September 2021",
    "techs": ["React", "JavaScript", "AWS", "REST APIs", "MERN Stack"],
    "work": [
      "Created mobile applications based on React, integrating Facebook's best practices for interface design.",
      "Designed REST calls using React to streamline user interface performance.",
      "Maintained high-level expertise in React state management strategies.",
      "Developed user interfaces for deployment on Amazon Web Services (AWS) platforms.",
      "Worked on a large-scale E-commerce project allowing designers to post and sell designs; enabled bidding and purchasing across India."
    ]
  },

  {
    "company": "Verizon",
    "role": "Security Engineer II",
    "duration": "December 2023 - August 2024",
    "techs": ["ForgeRock", "Java", "OAuth", "SAML", "DUO Security", "IAM", "MSSO", "CompTIA Security+"],
    "work": [
      "Integrated single sign-on solutions for 6300+ users with a single credential system.",
      "Developed and enforced 1000+ access control policies using ForgeRock and SAML to protect critical systems.",
      "Handled end-to-end identity lifecycle processes including onboarding/offboarding.",
      "Collaborated across teams to translate business needs into IAM solutions, reducing risk by 22%.",
      "Migrated 3000+ in-house applications to ForgeRock-managed access policies for compliance.",
      "Implemented OAuth, MSSO, and Multi-Factor Authentication to strengthen user access security.",
      "Executed a cybersecurity strategy that cut security incidents by 35%.",
      "Led a 4-member team in securing a portal with DUO and fingerprint login.",
      "Conducted CompTIA Security+ training sessions on IAM, SSDLC, and Risk Management for 50 employees."
    ]
  },

  {
    "company": "Arizona State University",
    "role": "Master's in Data Science & Analytics",
    "education": true,
    "duration": "August 2024 - Present",
    "courses": "Information Assurance Security, Statistical Machine Learning, Data Mining, Data Visualization, and Data Optimization."
  }
]
